"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/




// function userPercent(userNum){
//     const tax = 0.13;
//     const salary = userNum * (1 - tax);
//     console.log(`Размер заработной платы за вычетом налогов равен ${salary}.`);

// }

// const userInput = prompt("Введите число:");
// if(!isNaN(userInput)) {
//     const number = parseFloat(userInput);
//     userPercent(number);

// } else {
//     console.log("Значение задано неверно");
// }