"use strict";

/*
Необходимо попросить пользователя ввести три числа.
Необходимо создать функцию, в которую мы должны передать эти три числа.
Функция должна определить максимальное, среди переданных ей значение и 
вывести сообщение: "Максимальное значение среди чисел N1, N2, N3 равно N."

Примечание: Условимся, что пользователь всегда вводит корректные значения, 
три числа. Проверять их не нужно.
*/

// const number1 = parseFloat(prompt("Введите первое число:"));
// const number2 = parseFloat(prompt("Введите второе число:"));
// const number3 = parseFloat(prompt("Введите третье число:"));

// function findMax(N1, N2, N3) {
//     let max = Math.max(N1, N2, N3);
//     return max;
// }

// let maxNumber = findMax(number1, number2, number3);
// console.log(`Максимальное значение среди чисел ${number1}, ${number2}, ${number3} равно ${maxNumber}.`);